package by.academy.lesson4;

/*
 *Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
 */
public class Task1 {
    public static void main(String[] arg) {
        int x = 10;
        while (x <= 20) {
            System.out.println(x * x);
            x++;
        }
    }
}
